{"id":3005,"date":"2024-01-24T09:39:31","date_gmt":"2024-01-24T09:39:31","guid":{"rendered":"https:\/\/careerhike.in\/?page_id=3005"},"modified":"2024-01-24T09:39:31","modified_gmt":"2024-01-24T09:39:31","slug":"disclaimer","status":"publish","type":"page","link":"https:\/\/careerhike.in\/disclaimer\/","title":{"rendered":"Disclaimer"},"content":{"rendered":"<p>Our website aims to provide unbiased, accurate, and comparative information regarding institutes and their online courses to help students develop the skill or experience they seek.<\/p>\n<p>&nbsp;<\/p>\n<p>While we strive to maintain up-to-date and accurate information, we make no representations or warranties, express or implied, regarding the completeness, accuracy, reliability, suitability, or availability of the content on the website. This includes targeted listings, services, images, photos, blogs, videos, university logos, and other information collectively referred to as “Content.”<\/p>\n<p>&nbsp;<\/p>\n<p>The information and content on the site are provided “as is” and “as available” without any modification by our affiliates’ products or practical training. No advice, agreement, or information obtained from CareerHike EduTech or through the services shall create any warranty by CareerHike EduTech.<\/p>\n<p>&nbsp;<\/p>\n<p>CareerHike EduTech retains the right to display user images in promotional material. Under no circumstances will we share or disclose your personal information to any third-party business profile unless properly identified or as required by law.<\/p>\n<p>&nbsp;<\/p>\n<p>The website may contain references to trademarks, logos, and names of other companies. (“Third party Intellectual Property”), which are the property of their respective owners. The use of these names, trademarks, and product does not imply endorsement or infringement of intellectual property rights.<\/p>\n<p>&nbsp;<\/p>\n<p>Academic standards, university ratings, sponsorships, etc., on the website, as well as recommendations, reviews, and success stories, are personal experiences that may differ among users. We do not guarantee that these are typical results or experiences for most users.<\/p>\n<p>&nbsp;<\/p>\n<p>CareerHike EduTech and its affiliates are not responsible or liable for the content on the website, including any information, data, or material downloaded. We disclaim liability for errors, malfunctions, or losses resulting from data corruption or the use of data.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Our website aims to provide unbiased, accurate, and comparative information regarding institutes and their online courses to help students develop the skill or experience they seek. &nbsp; While we strive [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"footnotes":""},"acf":[],"_links":{"self":[{"href":"https:\/\/careerhike.in\/wp-json\/wp\/v2\/pages\/3005"}],"collection":[{"href":"https:\/\/careerhike.in\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/careerhike.in\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/careerhike.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/careerhike.in\/wp-json\/wp\/v2\/comments?post=3005"}],"version-history":[{"count":1,"href":"https:\/\/careerhike.in\/wp-json\/wp\/v2\/pages\/3005\/revisions"}],"predecessor-version":[{"id":3006,"href":"https:\/\/careerhike.in\/wp-json\/wp\/v2\/pages\/3005\/revisions\/3006"}],"wp:attachment":[{"href":"https:\/\/careerhike.in\/wp-json\/wp\/v2\/media?parent=3005"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}