{"id":3003,"date":"2024-01-24T09:38:45","date_gmt":"2024-01-24T09:38:45","guid":{"rendered":"https:\/\/careerhike.in\/?page_id=3003"},"modified":"2024-01-24T09:38:45","modified_gmt":"2024-01-24T09:38:45","slug":"term-conditions","status":"publish","type":"page","link":"https:\/\/careerhike.in\/term-conditions\/","title":{"rendered":"Term &#038; Conditions"},"content":{"rendered":"<p><strong>Please read the following carefully <\/strong><\/p>\n<p>These terms and conditions (“Terms and Conditions”) govern your use of this we bsite Careerhike.in (“Website”). In these Terms and Conditions, “CareerHike EduTech” refers to “Company”, “us” or “we”.<\/p>\n<p>“You” means the user or paying customer. If you are the company or another person authorized to access the Company’s products, you agree to accept full responsibility for any damage or compensation that may occur to your users’ property.<\/p>\n<p>The CareerHike EduTech Website (“Site”), the educational services and content provided through the Website (“Product”) are owned, operated and operated by CareerHike EduTech. (“we”, “us” or the “Company”). maintenance (if any). ‘). This website, products and content are collectively referred to as “Company Product”.<\/p>\n<p>By (a) using or accessing our products, including but not limited to downloading or accessing them, by (b) providing website in the course or through the software; You agree to the terms of the Terms and Conditions of Use (“Terms”).<\/p>\n<p>By using this website or its products and services, you acknowledge that you have read, understood and agree to be bound by them. Conditions. The Company’s privacy policy can be accessed from the Privacy Policy. If you do not agree to these Terms, you may not use (and have no right to use) all or any part of the Company Website and its products or services (as defined below).<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Please read them carefully before you use the services of this site<\/strong><\/p>\n<ul>\n<li>You must not use this website unlawfully; You must respect the website’s terms and conditions and comply with its privacy policy.<\/li>\n<li>However, the Company will not be responsible for any changes in the content it provided on the website through its products and services, including but not limited to those regarding our products, services or the correct use of our various products and services. Any errors, omissions, losses or damages related to the content (e-mails, blogs, etc.) provided by any services.<\/li>\n<li>Our services provide free internet access to all users. However, we are not responsible for any costs related to hardware, software usage or Internet services fees. In addition, the user is entirely responsible for the operation of the computer hardware and access to the internet.<\/li>\n<li>You are required to use authentication credentials for certain areas of the website and the company reserve the right to deny access tp our services to any user who does not comply with these rules.<\/li>\n<li>We ensure that users are not affected by these events. For our services, however, we have no obligation to do so.<\/li>\n<li>CareerHike EduTech is not responsible for your network or any problems within it. The server has exceeded the limit.<\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<p><strong>Website Usage guidelines <\/strong><\/p>\n<ul>\n<li>Do not insult, abuse, harass, threaten or violate the rights of others;<\/li>\n<li>Do not post, publish, distribution or publish obscene, illegal, incecent material or comments that are unfair, offensive or unlawful.<\/li>\n<li>Please do not upload, install or transmit any copyrighted material or software that interferes with other computers.<\/li>\n<li>Editing, reverse engineering or cracking the HTML source code is prohibited.<\/li>\n<li>Do not spam service\/scripts or anything else that could affect development and therefore users.<\/li>\n<li>Do not spam, advertise or sell services such as digital downloads, e-books or publishing links.<\/li>\n<li>You may not copy, distributes or download content or user submissions from the website.<\/li>\n<li>Please do not use content that violates any law, regulation, government or internet operator or code of conduct.<\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<p><strong>Link and Hyperlinks Terms<\/strong><\/p>\n<p>This website may contain links to other websites. We have no control over the content of these websites; We are not responsible for the content of the websites. The links included are for informational purposes only to the user. Therefore, the CareerHike EduTech will not be responsible.<\/p>\n<ul>\n<li>You may not mirror or embed the home page or other page of this website on any other website or webpage.<\/li>\n<li>Avoid linking to Careerhike.in page and pages containing spam links\/link post; This may create the wrong impression. This will cause user to make mistakes.<\/li>\n<li>Please do not use or include copyrighted or registered trademarks or creative images, designs or content as links to the CareerHike EduTech website.<\/li>\n<li>Do not link to page that promote hatred and violence.<\/li>\n<li>Do not link to page that provide pornographic content or violate the rights of humans and animals.<\/li>\n<li>Please do not link to content that violates the intellectual property rights of any third party, person or organization.<\/li>\n<li>Please do not link to content that violates laws, regulations, government or network operators or codes of conduct.<\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<p><strong>Copyright and Intellectual Property<\/strong><\/p>\n<p>We value and respect the intellectual property rights of other and expect our users to do the same.<\/p>\n<p>All content on this website is protected by copyright and trademark. The owners of the copyrights and trademarks are Careerhike EduTech. Its affiliates or third-party licensors. The information on the site (such as text, images, code and\/or software) is protected by law and cannot to be copied, changed published or reproduced in any way, as it belongs to the CareerHike EduTech.<\/p>\n<p>CareerHike EduTech is not responsible for the content of any other websites (except our partners and affiliates) that you may find when searching for or visiting the Careerhike.in or services. This information will be subject to the privacy policy and terms of use of the website you visit.<\/p>\n<p>CareerHike EduTech reserves all rights and intellectual property rights to disable or ban users who disrespect CareerHike EduTech and participate in violations of CareerHike EduTech.<\/p>\n<p>You may not use digital images or logos on the website. If there are legal issues, written permission must be obtained from the business owner.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Claim of Intellectual Property Violations<\/strong><\/p>\n<p>If you believe your work has been used without permission, it is considered illegal. Please provide us with the following information and we will process it.<\/p>\n<ul>\n<li>The authorized person acting on behalf of the copyright owner must submit a digital signature or physical signature.<\/li>\n<li>Help disclose the copyrighted work that you claim infringes your intellectual property rights.<\/li>\n<li>The explanation of where and how the information you requested has been violated is available on the CareerHike EduTech website and has sufficient details for us to find this explanation on the website.<\/li>\n<li>Contact information – address, phone number, and email address.<\/li>\n<li>A statement by you that the information you have provided is accurate and that you acknowledge the copyright or intellectual property rights on behalf of the owner.<\/li>\n<li>You can reach CareerHike EduTech by writing to us to notify us of your legal claim.<\/li>\n<\/ul>\n<p><strong> <\/strong><\/p>\n<p><strong>Transaction Terms<\/strong><\/p>\n<p>If you believe you work has been used without your permission, it is considered illegal. Please provide us with the information below and we will take action.<\/p>\n<ul>\n<li>You must pay this transfer fee to transfer on the CareerHike EduTech website.<\/li>\n<li>Please note your payment details including all fees, taxes, shipping, charges and discounts.<\/li>\n<li>Some product requires additional terms and conditions that you must agree to be fore purchasing.<\/li>\n<li>If the representative has completed the course and is entitled to receive a certificate, the certificate must be sent to the address specified by the representative within 30 business days.<\/li>\n<\/ul>\n<p><strong>WE MAKE NO WARRANTIES, EXPRESS OR IMPLIED, REGARDING ANY PRODUCT OR SERVICE SOLD THROUGH CAREERHIKE EDUTECH.<\/strong><\/p>\n<p>Any additional or distinct terms found in a purchase order, document, transmission, or any other communication will not be considered binding upon CareerHike EduTech unless explicitly agreed to in writing by CareerHike EduTech.<\/p>\n<p>Education reserves the right to change, modify, limit the order quantity of any product and refuse services to anyone in its sole discretion without prior notice.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Limit of Liability <\/strong><\/p>\n<p>YOU UNDERSTAND AND AGREE THAT COMPANY SHALL NOT BE LIABLE FOR ANY DIRECT, INDERECT, INCIDENTAL, SPECIAL, CONSEQUENTIAL DAMAGE OF ANY KING, including (even if company recommends) lost profit, malfunction, misuse, loss of data, or other damages. (1) use or inability to use the Services; (2) cost of products or services purchased or received, messages received or transactions entered into on the Website, or other purchases of goods and services; (3) unauthorized access to or alternation of your submissions, data or confidential information; (4) statement or actions of third parties regarding the Products; (5) or other matters relating to the goods.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Indemnity<\/strong><\/p>\n<p>You agree to indemnify and hold harmless the Company and our affiliates, partners , officers, directors, agents, and employees, from and against any claim or demand (including such legal and other professional fees) incurred by the third-party as a result of or arising out of; Use By using their terms or the information they contain, you are violating any law or the rights of a third-party.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Pricing Disclaimer<\/strong><\/p>\n<p>All pricing, products and offers on the Faculty of CareerHike EduTech website are subject to change without prior notice.<\/p>\n<p>While we ensure that we provide accurate and up-to-date information, sometime one or more products on our site may be incorrectly priced. This may be due to human error, digital imaging, technical errors, or inconsistencies in pricing information from our supplier.<\/p>\n<p>CareerHike EduTech reserves the right to change the prices of our products, offers or opportunities. These changes are due to the market, cancellations of classes, service providers, price changes, advertising errors and other discounts. However, the price you paid at the time of purchase still applies.<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Please read the following carefully These terms and conditions (“Terms and Conditions”) govern your use of this we bsite Careerhike.in (“Website”). In these Terms and Conditions, “CareerHike EduTech” refers to [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"footnotes":""},"acf":[],"_links":{"self":[{"href":"https:\/\/careerhike.in\/wp-json\/wp\/v2\/pages\/3003"}],"collection":[{"href":"https:\/\/careerhike.in\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/careerhike.in\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/careerhike.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/careerhike.in\/wp-json\/wp\/v2\/comments?post=3003"}],"version-history":[{"count":1,"href":"https:\/\/careerhike.in\/wp-json\/wp\/v2\/pages\/3003\/revisions"}],"predecessor-version":[{"id":3004,"href":"https:\/\/careerhike.in\/wp-json\/wp\/v2\/pages\/3003\/revisions\/3004"}],"wp:attachment":[{"href":"https:\/\/careerhike.in\/wp-json\/wp\/v2\/media?parent=3003"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}